USE QLNhanVien
CREATE TABLE BANGLUONG
(
  MANV char(10) FOREIGN KEY REFERENCES NHANVIEN(MANV),
  BacLuong int,
  ChucVu nvarchar(50),
  LuongChinh char(20),
  PhuCap char(20),
  BaoHiem char(20),
  Thue char(20),
  TongLuongNhan char(20)	
)
GO
INSERT INTO BANGLUONG(MANV,BacLuong,ChucVu,LuongChinh,PhuCap,BaoHiem,Thue,TongLuongNhan)
VALUES 
	('NV001',3,N'Tổng giám đốc','14.000.000','6.000.000','10.000.000','1.500.000','28.500.000'),
	('NV002',2,N'Trưởng Phòng','12.000.000','5.000.000','8.000.000','1.250.000','23.750.000'),
	('NV003',2,N'Trợ lý','12.000.000','5.000.000','8.000.000','1.250.000','23.750.000'),
	('NV004',1,N'Nhân viên','9.000.000','3.500.000','5.000.000','875.000','16.625.000'),
	('NV005',1,N'Nhân viên','8.500.000','3.500.000','5.000.000','850.000','16.150.000'),
	('NV006',1,N'Nhân viên','8.250.000','3.500.000','5.000.000','837.000','15.912.500'),
	('NV007',1,N'Nhân viên','8.000.000','3.500.000','5.000.000','825.000','15.675.000'),
	('NV008',1,N'Nhân viên','7.750.000','3.500.000','5.000.000','812.500','15.437.500'),
	('NV009',1,N'Nhân viên','7.500.000','3.500.000','5.000.000','800.000','15.200.000'),
	('NV010',1,N'Nhân viên','7.250.000','3.500.000','5.000.000','787.500','14.962.500'),
	('NV011',1,N'Nhân viên','7.000.000','3.500.000','5.000.000','775.000','14.725.000')
